testAme/labs/lab56/combustor2D-wf/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
15677
(
(-0.0895943 9.44174 0)
(0.0902343 9.88688 0)
(0.0313794 9.97067 0)
(0.040178 9.99641 0)
(0.0412612 10.0061 0)
(0.0398541 10.0101 0)
(0.037988 10.0117 0)
(0.0357409 10.012 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 10 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            noSlip;
    }
    fuel_inlet
    {
        type            fixedValue;
        value           uniform (0 15 0);
    }
    back
    {
        type            noSlip;
    }
    sides
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
