testAme/labs/lab56/combustor2D-wf/0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// ************************************************************************* //

dimensions          [0 0 0 0 0 0 0];

internalField       uniform 0;

boundaryField
{
    "(region0_to_wallFilmRegion_wallFilmFaces|back|sides|outlet)"
    {
        type                zeroGradient;
    }
    "(inlet|fuel_inlet)"
    {
        type                fixedValue;
        value               $internalField;
    }
}

// ************************************************************************* //
