testAme/labs/lab56/combustor2D-wf/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
15677
(
84.6225
23.3899
9.3924
5.05482
3.34306
2.55942
2.17581
1.99144
...
)
;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.02;
        value           uniform 2;
    }
    outlet
    {
        type            zeroGradient;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    fuel_inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.02;
        value           uniform 2;
    }
    back
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    sides
    {
        type            epsilonWallFunction;
        value           uniform 2;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
