testAme/labs/lab56/combustor2D-wf/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
15677
(
0.309734
0.363991
0.367661
0.369388
0.370805
0.371819
0.372505
0.372934
...
)
;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }
    outlet
    {
        type            zeroGradient;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    fuel_inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }
    back
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    sides
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
