testAme/labs/lab56/combustor2D-wf/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
15677
(
0.000102031
0.000509795
0.00129527
0.00242942
0.00370159
0.00486144
0.00573965
0.00628552
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    fuel_inlet
    {
        type            calculated;
        value           uniform 0;
    }
    back
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    sides
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
