testAme/labs/lab56/combustor2D-wf/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       31053;
    }
    outlet
    {
        type            patch;
        nFaces          121;
        startFace       31173;
    }
    splitter
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       31294;
    }
    fuel_inlet
    {
        type            patch;
        nFaces          20;
        startFace       31344;
    }
    back
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          31;
        startFace       31364;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          31354;
        startFace       31395;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          260;
        startFace       62749;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
260
(
(-0 -0 -0)
(2.77556e-17 -0 -0)
(-0 -0 -0)
(1.38778e-17 -0 -0)
(-0 2.77556e-17 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
...
)
;
    }
)

// ************************************************************************* //
