testAme/labs/lab56/combustor2D-wf/constant/wallFilmRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/wallFilmRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          2;
        startFace       258;
    }
    outlet
    {
        type            patch;
        nFaces          2;
        startFace       260;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          520;
        startFace       262;
    }
    wallFilmFaces_top
    {
        type            patch;
        nFaces          260;
        startFace       782;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          260;
        startFace       1042;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
260
(
(0 0 0)
(-2.77556e-17 0 0)
(0 0 0)
(-1.38778e-17 0 0)
(0 -2.77556e-17 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
)

// ************************************************************************* //
