testAme/labs/lab56/combustor2D-wf/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sprayFilmFoam;


startFrom       startTime;

startTime       0;

deltaT		1e-5;

stopAt          endTime;

endTime         0.1;

adjustTimeStep	yes;

maxCo		0.9;

writeControl    adjustableRunTime;

writeInterval   5e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
	#includeFunc	residuals(p,U,k,epsilon,h)
	#include	"functionObjects/fieldAverage.cpp"
	#include 	"functionObjects/forces.cpp"
	#include	"functionObjects/machNumber.cpp"
	#include	"functionObjects/pressure.cpp"
	#include	"functionObjects/temperature.cpp"
	#include	"functionObjects/yPlus.cpp"
}


/*
startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.05;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   5e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo 0.9;

functions
{
	#includeFunc	residuals
}

*/
// ************************************************************************* //

















